src/result/wrk_async_client.txt
  GET
  
  4 threads and 4 connections
  Thread calibration: mean lat.: 3.325ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 3.376ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 8.182ms, rate sampling interval: 30ms
  Thread calibration: mean lat.: 7.732ms, rate sampling interval: 28ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.56ms    5.36ms  47.65ms   83.39%
    Req/Sec     2.57k     1.49k    8.27k    65.63%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.58ms
 75.000%    8.61ms
 90.000%   13.24ms
 99.000%   22.22ms
 99.900%   31.22ms
 99.990%   39.68ms
 99.999%   46.08ms
100.000%   47.68ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.186     0.000000            1         1.00
       0.806     0.100000        18626         1.11
       1.135     0.200000        37188         1.25
       1.472     0.300000        55753         1.43
       1.919     0.400000        74329         1.67
       3.579     0.500000        92880         2.00
       4.695     0.550000       102170         2.22
       5.643     0.600000       111466         2.50
       6.507     0.650000       120754         2.86
       7.447     0.700000       130021         3.33
       8.615     0.750000       139349         4.00
       9.247     0.775000       143979         4.44
       9.911     0.800000       148606         5.00
      10.639     0.825000       153231         5.71
      11.431     0.850000       157869         6.67
      12.279     0.875000       162521         8.00
      12.735     0.887500       164842         8.89
      13.239     0.900000       167157        10.00
      13.815     0.912500       169482        11.43
      14.463     0.925000       171815        13.33
      15.191     0.937500       174134        16.00
      15.583     0.943750       175295        17.78
      16.023     0.950000       176443        20.00
      16.559     0.956250       177631        22.86
      17.135     0.962500       178771        26.67
      17.775     0.968750       179925        32.00
      18.175     0.971875       180525        35.56
      18.543     0.975000       181087        40.00
      19.039     0.978125       181672        45.71
      19.663     0.981250       182251        53.33
      20.495     0.984375       182828        64.00
      20.895     0.985938       183121        71.11
      21.311     0.987500       183408        80.00
      21.839     0.989062       183700        91.43
      22.495     0.990625       183988       106.67
      23.311     0.992188       184281       128.00
      23.775     0.992969       184424       142.22
      24.303     0.993750       184572       160.00
      24.879     0.994531       184716       182.86
      25.519     0.995313       184862       213.33
      26.463     0.996094       185009       256.00
      27.055     0.996484       185076       284.44
      27.471     0.996875       185150       320.00
      27.903     0.997266       185220       365.71
      28.319     0.997656       185292       426.67
      28.879     0.998047       185365       512.00
      29.215     0.998242       185401       568.89
      29.503     0.998437       185437       640.00
      29.903     0.998633       185475       731.43
      30.431     0.998828       185512       853.33
      31.375     0.999023       185547      1024.00
      31.727     0.999121       185565      1137.78
      32.175     0.999219       185582      1280.00
      32.623     0.999316       185601      1462.86
      33.311     0.999414       185620      1706.67
      34.175     0.999512       185638      2048.00
      34.495     0.999561       185646      2275.56
      34.751     0.999609       185656      2560.00
      35.039     0.999658       185665      2925.71
      35.647     0.999707       185673      3413.33
      36.735     0.999756       185682      4096.00
      37.119     0.999780       185687      4551.11
      37.343     0.999805       185692      5120.00
      37.855     0.999829       185696      5851.43
      38.623     0.999854       185700      6826.67
      39.231     0.999878       185705      8192.00
      39.487     0.999890       185707      9102.22
      39.775     0.999902       185709     10240.00
      40.543     0.999915       185712     11702.86
      40.863     0.999927       185714     13653.33
      41.439     0.999939       185716     16384.00
      43.103     0.999945       185717     18204.44
      43.199     0.999951       185718     20480.00
      43.519     0.999957       185720     23405.71
      44.095     0.999963       185721     27306.67
      44.191     0.999969       185722     32768.00
      44.191     0.999973       185722     36408.89
      44.927     0.999976       185723     40960.00
      44.959     0.999979       185724     46811.43
      44.959     0.999982       185724     54613.33
      46.079     0.999985       185725     65536.00
      46.079     0.999986       185725     72817.78
      46.079     0.999988       185725     81920.00
      47.519     0.999989       185726     93622.86
      47.519     0.999991       185726    109226.67
      47.519     0.999992       185726    131072.00
      47.519     0.999993       185726    145635.56
      47.519     0.999994       185726    163840.00
      47.679     0.999995       185727    187245.71
      47.679     1.000000       185727          inf
#[Mean    =        5.559, StdDeviation   =        5.359]
#[Max     =       47.648, Total count    =       185727]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  290033 requests in 30.00s, 18.49MB read
  Socket errors: connect 7, read 0, write 0, timeout 98
  Non-2xx or 3xx responses: 3
Requests/sec:   9666.54
Transfer/sec:    631.03KB


PUT

Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 13.257ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 10.726ms, rate sampling interval: 35ms
  Thread calibration: mean lat.: 14.856ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 10.488ms, rate sampling interval: 32ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.98ms    6.42ms  44.86ms   68.24%
    Req/Sec     2.53k     1.33k    6.26k    65.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.15ms
 75.000%   16.17ms
 90.000%   19.81ms
 99.000%   28.58ms
 99.900%   38.05ms
 99.990%   42.59ms
 99.999%   44.13ms
100.000%   44.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.201     0.000000            1         1.00
       2.387     0.100000        18588         1.11
       6.323     0.200000        37170         1.25
       8.663     0.300000        55762         1.43
      10.519     0.400000        74353         1.67
      12.151     0.500000        92918         2.00
      12.951     0.550000       102224         2.22
      13.759     0.600000       111554         2.50
      14.567     0.650000       120866         2.86
      15.343     0.700000       130093         3.33
      16.167     0.750000       139384         4.00
      16.607     0.775000       144140         4.44
      17.071     0.800000       148706         5.00
      17.599     0.825000       153306         5.71
      18.223     0.850000       158007         6.67
      18.927     0.875000       162652         8.00
      19.343     0.887500       164986         8.89
      19.807     0.900000       167302        10.00
      20.319     0.912500       169607        11.43
      20.895     0.925000       171889        13.33
      21.599     0.937500       174218        16.00
      21.999     0.943750       175411        17.78
      22.399     0.950000       176555        20.00
      22.847     0.956250       177714        22.86
      23.343     0.962500       178854        26.67
      23.951     0.968750       180017        32.00
      24.287     0.971875       180599        35.56
      24.751     0.975000       181176        40.00
      25.279     0.978125       181757        45.71
      25.887     0.981250       182334        53.33
      26.639     0.984375       182926        64.00
      27.119     0.985938       183210        71.11
      27.599     0.987500       183499        80.00
      28.207     0.989062       183792        91.43
      28.831     0.990625       184081       106.67
      29.551     0.992188       184367       128.00
      29.935     0.992969       184512       142.22
      30.319     0.993750       184658       160.00
      30.831     0.994531       184802       182.86
      31.503     0.995313       184950       213.33
      32.383     0.996094       185096       256.00
      32.831     0.996484       185165       284.44
      33.311     0.996875       185240       320.00
      33.759     0.997266       185314       365.71
      34.239     0.997656       185388       426.67
      34.751     0.998047       185458       512.00
      35.007     0.998242       185492       568.89
      35.263     0.998437       185529       640.00
      35.711     0.998633       185564       731.43
      37.343     0.998828       185601       853.33
      38.079     0.999023       185640      1024.00
      38.207     0.999121       185655      1137.78
      38.431     0.999219       185677      1280.00
      38.623     0.999316       185692      1462.86
      38.815     0.999414       185710      1706.67
      38.975     0.999512       185731      2048.00
      39.039     0.999561       185737      2275.56
      39.135     0.999609       185750      2560.00
      39.263     0.999658       185755      2925.71
      39.455     0.999707       185764      3413.33
      39.615     0.999756       185773      4096.00
      39.743     0.999780       185778      4551.11
      39.839     0.999805       185784      5120.00
      40.031     0.999829       185789      5851.43
      40.255     0.999854       185791      6826.67
      42.207     0.999878       185796      8192.00
      42.431     0.999890       185798      9102.22
      42.591     0.999902       185800     10240.00
      42.783     0.999915       185803     11702.86
      42.911     0.999927       185806     13653.33
      42.975     0.999939       185807     16384.00
      43.007     0.999945       185808     18204.44
      43.135     0.999951       185809     20480.00
      43.359     0.999957       185811     23405.71
      43.871     0.999963       185812     27306.67
      43.935     0.999969       185813     32768.00
      43.935     0.999973       185813     36408.89
      43.999     0.999976       185814     40960.00
      44.031     0.999979       185815     46811.43
      44.031     0.999982       185815     54613.33
      44.127     0.999985       185816     65536.00
      44.127     0.999986       185816     72817.78
      44.127     0.999988       185816     81920.00
      44.735     0.999989       185817     93622.86
      44.735     0.999991       185817    109226.67
      44.735     0.999992       185817    131072.00
      44.735     0.999993       185817    145635.56
      44.735     0.999994       185817    163840.00
      44.895     0.999995       185818    187245.71
      44.895     1.000000       185818          inf
#[Mean    =       11.977, StdDeviation   =        6.419]
#[Max     =       44.864, Total count    =       185818]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  287872 requests in 30.00s, 18.39MB read
  Socket errors: connect 7, read 0, write 0, timeout 98
  Non-2xx or 3xx responses: 17
Requests/sec:   9595.78
Transfer/sec:    627.86KB

В этот раз довольно сложно сравнить реализации, так как результаты получены на другой машине и системе. В прошлый раз был использован Macbook Air c MacOS, а сейчас виртульная машина с Ubuntu. Помимо технических характеристик изменились и системные вызовы. Однако, реализация сделана так, что теперь при проксировании не происходит ожидания ответов, которые не нужны клиенту, что должно уменьшить время ответа. Ожидалось, что запрос к DAO также будет выполняться асинхронно, но из за неизвестных технических трудностей в RocksDB 
этого сделать неудалось. Данная проблема воспроизоводиться во время сборки в Travis, но не локально. Возможно, это из за использования OpenJDK, тогда как локально использовалась Oracle JDK. Были также запущены тесты с использваонием OpenJDK на JVM Hotspot и OpenJ9, но ошибку воспроизвести неудалось.